#include <stdio.h>

int main() {
	// shift 연산자
	// << left  shift 연산자
	// >> right shift 연산자
	unsigned short a = 1;		// 00000000 00000001

	// 왼쪽 shift
	// 왼쪽으로 1비트씩 이동시킨다는 의미? x 2
	a = a << 1;

	//      00000000 00000001
	//      00000000 00000010 (2)
	printf("a = %d\n", a);

	a = a << 2;
	//      00000000 00000010
	//      00000000 00001000 (8)
	printf("a = %d\n", a);

	a = a << 2;
	//      00000000 00001000 (8)
	//      00000000 00100000 (32)
	printf("a = %d\n", a);

	// 오른쪽 shift
	// 오른쪽을 1비트 민다는 의미는 ? / 2
	a = a >> 1;
	//      00000000 00100000 (32)
	//      00000000 00010000 (16)
	printf("a = %d\n", a);


	a = a >> 2;
	//      00000000 00010000 (16)
	///     00000000 00000100
	printf("a = %d\n", a);





	return 0;
}